//
//  RoulletManager.swift
//  Roullet
//
//  Created by 김성호 on 2023/06/19.
//

import UIKit
import Then


struct RoulletModel {
    // 전체 배열
    var allFood: [String] = ["국밥", "부대찌게", "삼겹살", "떡볶이", "김밥", "감자탕", "닭갈비", "돈까스", "냉면", "치킨","짜장면", "깐풍기", "유린기", "짬뽕", "새우볶음밥", "간짜장", "양장피", "팔보채", "크림새우", "짜장면", "깐풍기", "유린기", "짬뽕", "새우볶음밥", "간짜장", "양장피", "팔보채", "크림새우", "초밥", "규카츠", "장어덮밥", "텐동", "라멘", "메밀소바", "우동", "사케동", "봉골레", "스테이크", "리조또", "까르보나라", "토마토", "피자", "라자냐", "타코", "뇨끼", "똠얌꿍", "쌀국수", "팟타이", "분짜", "껌땀 사이공", "반미", "짜조", "나시고랭", "월남쌈", "볶음밥", "샐러드", "닭가슴살", "곤약 볶음밥", "죽", "해초라면", "삶은달걀", "샌드위치", "물"]
    // 한식 배열
    var koreaFood: [String] = ["국밥", "부대찌게", "삼겹살", "떡볶이", "김밥", "감자탕", "닭갈비", "돈까스", "냉면", "치킨", "라면", "비빔밥", "삼겹살", "삼계탕"]
    // 중식 배열
    var chineseFood: [String] = ["짜장면", "깐풍기", "유린기", "짬뽕", "새우볶음밥", "간짜장", "양장피", "팔보채", "크림새우", "베이징덕"]
    // 일식 배열
    var japaneseFood: [String] = ["초밥", "규카츠", "장어덮밥", "텐동", "라멘", "메밀소바", "우동", "사케동", "냉우동", "돈카츠", "에비동"]
    // 양식 배열
    var westernFood: [String] = ["봉골레", "스테이크", "리조또", "까르보나라", "토마토", "피자", "라자냐", "타코", "뇨끼"]
    
    // 베트남 배열
    var vietnamFood: [String] = ["똠얌꿍", "쌀국수", "팟타이", "분짜", "껌땀 사이공", "반미", "짜조", "나시고랭", "월남쌈", "볶음밥"]
    
    // 멕시코 배열
    var mexicoFood: [String] = ["타코", "파하타", "엔칠라다", "나초", "퀘사디아", "스테이크", "화이타", "부리또", "보울", "샐러드"]
    
    // 건강식 배열
    var healthyFood: [String] = ["샐러드", "닭가슴살", "곤약 볶음밥", "죽", "해초라면", "삶은달걀", "샌드위치", "물"]
    
    
    // 어떤 음식배열을 고를지에 대한 배열 ex) 1 == 전체배열, 2 == 한식 ...
    var texts: [String] = [" ", " ", " ", " ", " ", " ", " ", " "]
}
